# NewUV Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewUV Method
Application Class See Also
---
Creates a UV object at the origin.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public UV NewUV()
```

Visual Basic
---
```text
Public Function NewUV As UV
```

Visual C++
---
```text
public:
UV^ NewUV()
```

# See Also
Application Class
NewUV Overload
Autodesk.Revit.Creation Namespace